<?php

namespace Imee\Helper\Constant;

class AutoChatConstant
{
    //问题类型
    public const QUESTION_TYPE = [
        1  => '平台功能',
        2  => '审核问题',
        3  => '平台玩法',
        4  => '平台活动',
        5  => '派对房问题',
        6  => '充值收益',
        7  => '投诉举报',
        8  => '处罚申诉',
        9  => '平台Bug',
        10 => '风控问题',
        11 => '提现问题',
        12 => '身份证问题',
        13 => '账号封禁问题',
        14 => '师徒问题',
        15 => '认证角色问题',
        16 => '礼物问题',
        17 => '公会问题',
        18 => '家族问题',
        19 => '注销问题',
        20 => 'APP问题',
        21 => '其他',
    ];
}
