<?php

namespace Imee\Models\Xs;

class XsUserEmoticonCardRecord extends BaseModel
{
    public const SCHEMA_READ = 'xsserverslave';
    
    public static $effectiveDays = [
        1 => '1天',
        3 => '3天',
        7 => '7天',
        15 => '15天',
        30 => '30天',
    ];

    public static $canSend = [
        '0' => '否',
        '1' => '是',
    ];

    public static $status = [
        1 => '未使用',
        2 => '审核中',
        3 => '审核通过',
        4 => '审核不通过',
        5 => '已过期',
        6 => '已失效',
    ];

    public static $source = [
        '0' => '后台下发',
        '1' => '用户赠送',
        '2' => '活动下发',
    ];

    public static $rejectType = [
        "1" => "涉黄低俗：包含色情、性暗示内容",
        "2" => "涉政：包含政治敏感内容",
        "3" => "违法行为：赌博、毒品、枪支、违禁品等违法内容",
        "4" => "涉宗教：包含宗教敏感内容",
        "5" => "暴力血腥：有暴力、流血、虐待等内容",
        "6" => "诈骗/欺骗 ：引导诈骗、诱导、虚假信息",
        "7" => "不文明用语：含侮辱、谩骂、歧视性语言",
        "8" => "广告推广：包含广告、水印、二维码等推广信息",
        "9" => "联系方式：包含Line，手机号码等",
        "10" => "违规交易 ： 涉及违法服务、非法售卖行为等",
        "11" => "未成年不适：未成年/对未成年人不友好或诱导行为",
        "12" => "侵犯隐私：曝露身份证、手机号、住址等隐私信息",
        "13" => "图片质量差 ：图片模糊、丑陋、不美观",
        "14" => "侵权内容 ： 含未经授权的品牌logo、人物名",
        "15" => "其他违规行为：请联系官方运营人员确认",
        "16" => "招募主播：引导主播加入公会",
        "17" => "币商宣传：为币商宣传",
    ];
}